---
kind: method
id: M:Autodesk.Revit.DB.ElementId.Compare(Autodesk.Revit.DB.ElementId)
source: html/697d29f7-4d22-b576-9abc-fbe64803737a.htm
---
# Autodesk.Revit.DB.ElementId.Compare Method

Compares two element ids.

## Syntax (C#)
```csharp
public int Compare(
	ElementId id
)
```

## Parameters
- **id** (`Autodesk.Revit.DB.ElementId`) - The ElementId to be compared with this ElementId.

## Returns
-1 if this element id is less than id, 0 if equal, 1 if greater.